#========================================
# 최초 작성자: 송찬영
# 최초 작성일: 2023.11.03
# 목적: 타이틀 화면의 최적화
#========================================
extends Node

# 나가기 확인 패널
@onready var quitCheck = $UI/QuitCheck


#========================================
# 목적: 게임 씬을 저장 슬롯 씬으로 변경하는 함수
# 매개변수: 없음
# 반환값: 없음
#========================================
func StartGame():
	get_tree().change_scene_to_file("res://SaveSelect/SaveSelect.tscn")


#========================================
# 목적: 게임 씬을 환경 설정 씬으로 변경하는 함수
# 매개변수: 없음
# 반환값: 없음
#========================================
func OpenOption():
	$UI/Option.visible = true


#========================================
# 목적: 게임 나가기를 누르면 재확인 패널을 활성화 하는 함수
# 매개변수: 없음
# 반환값: 없음
#========================================
func QuitButton():
	quitCheck.visible = true


#========================================
# 목적: 게임을 종료하는 함수
# 매개변수: 없음
# 반환값: 없음
#========================================
func QuitGame():
	get_tree().quit()


#========================================
# 목적: 게임 종료 확인 패널을 비확성화하는 화면
# 매개변수: 없음
# 반환값: 없음
#========================================
func QuitCancel():
	quitCheck.visible = false
